app/controllers/admin/cms_pages_controller.rb

  def index
    @cms_pages = CmsPage.all
---
SELECT * FROM `cms_pages`

  def show
    @cms_page = CmsPage.find(params[:id])
---
SELECT * FROM `cms_pages` WHERE (`cms_pages`.`id` = 1)

  def edit
    @cms_page = CmsPage.find(params[:id])
---
SELECT * FROM `cms_pages` WHERE (parent_id = 0) ORDER BY position

  def create
    params[:cms_page][:parent_id] = 0 if params[:cms_page][:parent_id].blank?
    @cms_page = CmsPage.new(params[:cms_page])

    respond_to do |format|
      if @cms_page.save
---
SELECT * FROM `cms_pages` WHERE (`cms_pages`.parent_id = 1) ORDER BY position
INSERT INTO `cms_pages` (`updated_at`, `title`, `body`, `meta_keyword`, `meta_description`, `sub_title`, `reference_string`, `sub_title_url`, `position`, `parent_id`, `created_at`) VALUES('2009-04-15 19:02:03', 'What types of projects does ddd do?', 'As a programer, most of my jobs are developing software for the web. Those of you seeking high-concept visual design and branding, you are still in the right place. I have a large pool of extremely talented, professional, graphic-designers and artists with whom I collaborate regularly. \r\n\r\nFor a list of my current designers and links to their work please contact me directly.', '', '', 'I specialize in enterprise stuff, but I also do ecommerce, community sites, internal data-management tools, and all sorts of personal content management systems (CMS) and online portfolios.', 'Projects: Index', NULL, NULL, 0, '2009-04-15 19:02:03')

  def update
    @cms_page = CmsPage.find(params[:id])
    params[:cms_page][:parent_id] = 0 if params[:cms_page][:parent_id].blank?
    respond_to do |format|
      if @cms_page.update_attributes(params[:cms_page])
---
SELECT * FROM `cms_pages` WHERE (`cms_pages`.parent_id = 1) ORDER BY position
SELECT * FROM `cms_pages` LIMIT 1
UPDATE `cms_pages` SET `body` = 'A free, one-hour, initial consultation is given, to all perspective clients. This is best done face-to-face. The goal of the consultation is to document the project objectives and determine an appropriate course of action. \r\n\r\nMy written follow write-up will contain:\r\n	1. An outline of my understanding of your initial requirements\r\n	2. A guess at the total scope of the project\r\n	3. A break down of the steps that will be needed to complete the project, \r\n	4. Recommendations for each step\r\n\r\nThe outline portion of the write-up will serve as a starting point for the discovery phase.\r\n\r\nTo schedule a consultation please contact me at any time.', `updated_at` = '2009-04-15 20:40:30' WHERE `id` = 6