app/controllers/admin/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("updated_at", "title", "body", "meta_keyword", "meta_description", "sub_title", "reference_string", "position", "parent_id", "allow_comments", "created_at") VALUES('2009-03-16 21:26:32', '', '', '', '', '', 'Home', NULL, NULL, 'f', '2009-03-16 21:26:32')

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE (parent_id = 0) ORDER BY position
UPDATE "posts" SET "body" = '*For first* timers and people needing small to med size web site.', "updated_at" = '2009-03-17 04:17:50' WHERE "id" = 1