app/controllers/admin/projects_controller.rb

  def index
    @projects = Project.all
---
SELECT * FROM `projects` ORDER BY position

  def show
    @project = Project.find(params[:id])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 9) ORDER BY position

  def edit
    @project = Project.find(params[:id])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 9) ORDER BY position

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO `projects` (`photo_file_name`, `photo_file_size`, `updated_at`, `title`, `featured`, `url`, `description`, `photo_content_type`, `teaser`, `position`, `parent_id`, `featured_on`, `created_at`) VALUES(NULL, NULL, '2009-04-15 18:10:41', 'ZXONEX', 1, 'http://www.zxonex.com', 'ZXONEX began as a code review for Adam, who found me on Craigslist. After the review, it was clear that ZXONEX had been afflicted by, the very common, bad-developer-syndrom. We decided to start from scratch. Adam and I spent our discovery phase translating his innovative vision of a politically-focused online-community into a functional specification and development plan.\r\n\r\nSome of ZXONEX’s feature highlights include a fast and granular search engine powered by Thinking-Sphinx and YouTube-like video uploading and encoding.\r\n\r\nZXONEX is a Ruby On Rails application. Primary development was done on Rails 2.3.2. It is hosted on a VPS with a Mongrel cluster proxied by Apache. Database is MySQL.\r\n\r\nThe client side is valid XHTML 1.0 Strict and CSS 2.1. jQuery is used for the dom-scripting and AJAX.', NULL, '_ZXONEX is a politically-focused online-community monotized by the sale of advertising space._', NULL, 0, NULL, '2009-04-15 18:10:41')

  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])
---
SELECT * FROM `projects` WHERE (parent_id = 0) ORDER BY position, position
UPDATE `projects` SET `description` = 'ZXONEX began as a code review for Adam, who found me on Craigslist. After the review, it was clear that ZXONEX had been afflicted by, the very common, bad-developer-syndrom. We decided to start from scratch. Adam and I spent our discovery phase translating his innovative vision of a politically-focused online-community into a functional specification and development plan.\r\n\r\nSome of ZXONEX’s feature highlights include a fast and granular search engine powered by Thinking-Sphinx and YouTube-like video uploading and encoding.', `teaser` = '_ZXONEX is a politically-focused online-community monotized by the sale of advertising space._\r\n\r\n\r\nZXONEX is a Ruby On Rails application. Primary development was done on Rails 2.3.2. It is hosted on a VPS with a Mongrel cluster proxied by Apache. Database is MySQL.\r\n\r\nThe client side is valid XHTML 1.0 Strict and CSS 2.1. jQuery is used for the dom-scripting and AJAX.', `updated_at` = '2009-04-15 18:31:25' WHERE `id` = 9