app/controllers/cms_pages_controller.rb

SELECT * FROM `projects` WHERE (`projects`.`featured` = 1) ORDER BY position LIMIT 1
---
  def home
    @featured_project = Project.featured.first